src/Catalogs/Команды/Команды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Команды</name>
  <attributes>
    <name>ПередЗапускомОсновнойКоманды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Команды</name>
    <attributes>
      <name>Команда</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/КомандыЗапускаПриложенияПовтИсп/Module.bsl
Функция КомандыЗапускаПеред() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КомандыКоманды.Команда
		|ИЗ
		|	Справочник.Команды.Команды КАК КомандыКоманды
		|ГДЕ
		|	КомандыКоманды.Ссылка.ПередЗапускомОсновнойКоманды
		|	И НЕ КомандыКоманды.Ссылка.ПометкаУдаления";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Команда");
	
КонецФункции

Функция КомандыЗапускаПосле() Экспорт

	Возврат "";
	
КонецФункции
